#include "method.h"

int problem_50() {
	char answer[10][10] = {
		{ 'o', 'o', 'o', 'o', 'o', 'o', 'o', 'o', 'o', 'x' },
		{ 'o', 'x', 'o', 'x', 'o', 'o', 'o', 'o', 'o', 'o' },
		{ 'x', 'o', 'o', 'o', 'o', 'o', 'o', 'o', 'o', 'o' }, 
		{ 'o', 'o', 'o', 'x', 'o', 'x', 'o', 'x', 'o', 'o' }, 
		{ 'o', 'o', 'o', 'o', 'o', 'o', 'o', 'x', 'o', 'x' }, 
		{ 'o', 'x', 'o', 'x', 'o', 'x', 'o', 'x', 'o', 'x' }, 
		{ 'o', 'o', 'o', 'o', 'o', 'o', 'o', 'o', 'o', 'o' }, 
		{ 'o', 'o', 'o', 'o', 'x', 'o', 'o', 'o', 'o', 'o' }, 
		{ 'x', 'o', 'x', 'o', 'x', 'o', 'x', 'o', 'o', 'o' }, 
		{ 'x', 'x', 'x', 'x', 'o', 'x', 'x', 'o', 'o', 'o' } };
	int grade[10] = { 0 };
	int i, j;

	printf("\t>문항별채점결과<\n");
	printf("=====================================================\n");
	printf(" 문항");
	for (i = 1 ; i <= 10 ; i++) {
		printf("%4d", i);
	}
	printf("   점수 \n");
	printf(" 학생\n");
	printf("=====================================================\n");
	for (i = 0 ; i < 10 ; i++) {
		printf("%3d번", i + 1);
		for (j = 0 ; j < 10 ; j++) {
			printf("%4c", answer[i][j]);
			if (answer[i][j] == 'o') {
				grade[i]++;
			}
		}
		printf("%5d점\n", grade[i]);
	}
	printf("=====================================================\n");

	return 0;
}